### Terraform Plan: `dev/02-iam`

<details>
<summary>Show Plan</summary>

```terraform
module.iam_eks.data.aws_iam_policy_document.node_assume_role: Reading...
module.iam_eks.data.aws_iam_policy_document.cluster_autoscaler: Reading...
data.aws_caller_identity.current: Reading...
module.iam_eks.data.aws_iam_policy_document.ebs_csi_driver: Reading...
module.iam_eks.data.aws_iam_policy_document.cluster_assume_role: Reading...
module.iam_eks.data.aws_iam_policy_document.aws_load_balancer_controller: Reading...
module.iam_eks.data.aws_iam_policy_document.external_dns: Reading...
module.iam_eks.data.aws_iam_openid_connect_provider.cluster[0]: Reading...
module.iam_eks.data.aws_iam_policy_document.cluster_assume_role: Read complete after 0s [id=3552664922]
module.iam_eks.data.aws_iam_policy_document.node_assume_role: Read complete after 0s [id=2851119427]
module.iam_eks.data.aws_iam_policy_document.cluster_autoscaler: Read complete after 0s [id=1084086464]
module.iam_eks.data.aws_iam_policy_document.external_dns: Read complete after 0s [id=3264049414]
module.iam_eks.data.aws_iam_policy_document.aws_load_balancer_controller: Read complete after 0s [id=1100055062]
module.iam_eks.data.aws_iam_policy_document.ebs_csi_driver: Read complete after 0s [id=234983187]
data.aws_caller_identity.current: Read complete after 0s [id=851725636341]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.iam_eks.aws_iam_instance_profile.node will be created
  + resource "aws_iam_instance_profile" "node" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "eks-gitops-dev-eks-node-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "eks-gitops-dev-eks-node-role"
      + tags        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-node-instance-profile"
          + "Project"     = "eks-gitops"
          + "Type"        = "eks-node"
        }
      + tags_all    = {
          + "CostCenter"  = "engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-node-instance-profile"
          + "Project"     = "eks-gitops"
          + "Repository"  = "aws-eks-production"
          + "Type"        = "eks-node"
        }
      + unique_id   = (known after apply)
    }

  # module.iam_eks.aws_iam_policy.aws_load_balancer_controller[0] will be created
  + resource "aws_iam_policy" "aws_load_balancer_controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for AWS Load Balancer Controller (skeleton - to be expanded)"
      + id               = (known after apply)
      + name             = "eks-gitops-dev-eks-aws-load-balancer-controller-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeListeners",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "LoadBalancerControllerBasic"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-aws-load-balancer-controller-policy"
          + "Project"     = "eks-gitops"
          + "Type"        = "irsa-policy"
        }
      + tags_all         = {
          + "CostCenter"  = "engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-aws-load-balancer-controller-policy"
          + "Project"     = "eks-gitops"
          + "Repository"  = "aws-eks-production"
          + "Type"        = "irsa-policy"
        }
    }

  # module.iam_eks.aws_iam_policy.cluster_autoscaler[0] will be created
  + resource "aws_iam_policy" "cluster_autoscaler" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for Cluster Autoscaler to manage ASG scaling"
      + id               = (known after apply)
      + name             = "eks-gitops-dev-eks-cluster-autoscaler-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeNodegroup",
                          + "ec2:GetInstanceTypesFromInstanceRequirements",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeImages",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ClusterAutoscalerAll"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:SetDesiredCapacity",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "autoscaling:ResourceTag/k8s.io/cluster-autoscaler/eks-gitops-dev-eks" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ClusterAutoscalerOwn"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-cluster-autoscaler-policy"
          + "Project"     = "eks-gitops"
          + "Type"        = "irsa-policy"
        }
      + tags_all         = {
          + "CostCenter"  = "engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-cluster-autoscaler-policy"
          + "Project"     = "eks-gitops"
          + "Repository"  = "aws-eks-production"
          + "Type"        = "irsa-policy"
        }
    }

  # module.iam_eks.aws_iam_policy.ebs_csi_driver[0] will be created
  + resource "aws_iam_policy" "ebs_csi_driver" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for EBS CSI Driver to manage EBS volumes"
      + id               = (known after apply)
      + name             = "eks-gitops-dev-eks-ebs-csi-driver-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:ModifyVolume",
                          + "ec2:DetachVolume",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeVolumeStatus",
                          + "ec2:DescribeVolumeAttribute",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeSnapshotAttribute",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DeleteVolume",
                          + "ec2:DeleteSnapshot",
                          + "ec2:CreateVolume",
                          + "ec2:CreateSnapshot",
                          + "ec2:AttachVolume",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "EBSCSICreateVolume"
                    },
                  + {
                      + Action    = "ec2:CreateTags"
                      + Condition = {
                          + StringEquals = {
                              + "ec2:CreateAction" = [
                                  + "CreateVolume",
                                  + "CreateSnapshot",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                      + Sid       = "EBSCSICreateTags"
                    },
                  + {
                      + Action   = "ec2:DeleteTags"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                      + Sid      = "EBSCSIDeleteTags"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-ebs-csi-driver-policy"
          + "Project"     = "eks-gitops"
          + "Type"        = "irsa-policy"
        }
      + tags_all         = {
          + "CostCenter"  = "engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-ebs-csi-driver-policy"
          + "Project"     = "eks-gitops"
          + "Repository"  = "aws-eks-production"
          + "Type"        = "irsa-policy"
        }
    }

  # module.iam_eks.aws_iam_policy.external_dns[0] will be created
  + resource "aws_iam_policy" "external_dns" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for External DNS to manage Route53 records"
      + id               = (known after apply)
      + name             = "eks-gitops-dev-eks-external-dns-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ListResourceRecordSets",
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::hostedzone/*"
                      + Sid      = "ExternalDNSRoute53"
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZonesByName",
                          + "route53:ListHostedZones",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ExternalDNSListHostedZones"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-external-dns-policy"
          + "Project"     = "eks-gitops"
          + "Type"        = "irsa-policy"
        }
      + tags_all         = {
          + "CostCenter"  = "engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-external-dns-policy"
          + "Project"     = "eks-gitops"
          + "Repository"  = "aws-eks-production"
          + "Type"        = "irsa-policy"
        }
    }

  # module.iam_eks.aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-gitops-dev-eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-cluster-role"
          + "Project"     = "eks-gitops"
          + "Type"        = "eks-cluster"
        }
      + tags_all              = {
          + "CostCenter"  = "engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-cluster-role"
          + "Project"     = "eks-gitops"
          + "Repository"  = "aws-eks-production"
          + "Type"        = "eks-cluster"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_eks.aws_iam_role.node will be created
  + resource "aws_iam_role" "node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-gitops-dev-eks-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-node-role"
          + "Project"     = "eks-gitops"
          + "Type"        = "eks-node"
        }
      + tags_all              = {
          + "CostCenter"  = "engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "iam-eks"
          + "Name"        = "eks-gitops-dev-eks-node-role"
          + "Project"     = "eks-gitops"
          + "Repository"  = "aws-eks-production"
          + "Type"        = "eks-node"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-gitops-dev-eks-cluster-role"
    }

  # module.iam_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-gitops-dev-eks-cluster-role"
    }

  # module.iam_eks.aws_iam_role_policy_attachment.node_AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "node_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-gitops-dev-eks-node-role"
    }

  # module.iam_eks.aws_iam_role_policy_attachment.node_AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "node_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-gitops-dev-eks-node-role"
    }

  # module.iam_eks.aws_iam_role_policy_attachment.node_AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "node_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-gitops-dev-eks-node-role"
    }

  # module.iam_eks.aws_iam_role_policy_attachment.node_AmazonSSMManagedInstanceCore[0] will be created
  + resource "aws_iam_role_policy_attachment" "node_AmazonSSMManagedInstanceCore" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eks-gitops-dev-eks-node-role"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_load_balancer_controller_policy_arn = (known after apply)
  + cluster_autoscaler_policy_arn           = (known after apply)
  + cluster_role_arn                        = (known after apply)
  + cluster_role_name                       = "eks-gitops-dev-eks-cluster-role"
  + ebs_csi_policy_arn                      = (known after apply)
  + external_dns_policy_arn                 = (known after apply)
  + iam_summary                             = {
      + cluster_name          = "eks-gitops-dev-eks"
      + cluster_role          = (known after apply)
      + irsa_policies_created = {
          + aws_load_balancer_controller = true
          + cluster_autoscaler           = true
          + ebs_csi                      = true
          + external_dns                 = true
        }
      + node_instance_profile = "eks-gitops-dev-eks-node-instance-profile"
      + node_role             = (known after apply)
      + oidc_configured       = false
      + ssm_enabled           = true
    }
  + node_instance_profile_name              = "eks-gitops-dev-eks-node-instance-profile"
  + node_role_arn                           = (known after apply)
  + node_role_name                          = "eks-gitops-dev-eks-node-role"
  + oidc_provider_arn                       = ""
  + oidc_provider_url                       = ""

Error: reading IAM OIDC Provider: operation error IAM: GetOpenIDConnectProvider, 1 validation error(s) found.
- missing required field, GetOpenIDConnectProviderInput.OpenIDConnectProviderArn.


  with module.iam_eks.data.aws_iam_openid_connect_provider.cluster[0],
  on ../../../modules/iam-eks/oidc.tf line 35, in data "aws_iam_openid_connect_provider" "cluster":
  35: data "aws_iam_openid_connect_provider" "cluster" {


```

</details>

**Plan Status:** ✅ Success
